#include <iomanip>
#include <iostream>
#include <cmath>

using namespace std;

int main() {
    int a, b, c, d;
    cout << "Введіть координати початкового поля (a b): ";
    cin >> a >> b;
    cout << "Введіть координати цільового поля (c d): ";
    cin >> c >> d;
    if (a < 1 || a > 8 || b < 1 || b > 8 || c < 1 || c > 8 || d < 1 || d > 8) {
        cout << "Помилка: координати повинні бути в діапазоні від 1 до 8" << endl;
    } else {
        if (a == c && b == d) {
            cout << "Початкове і цільове поля співпадають!" << endl;
        } else {
            if ((a == c) || (b == d) || (abs(a - c) == abs(b - d))) {
                cout << "Ферзь може потрапити з (" << a << ", " << b
                     << ") на (" << c << ", " << d << ") за один хід" << endl;
            } else {
                cout << "Ферзь добереться за два ходи:" << endl;
                cout << "1. Перший хід: з (" << a << ", " << b << ") на (" << c << ", " << b << ")." << endl;
                cout << "2. Другий хід: з (" << c << ", " << b << ") на (" << c << ", " << d << ")." << endl;
            }
        }
    }
}
